[
  {
    "name": "Stryker",
    "logo": "/img/partners/stryker.jpg",
    "url": "https://www.stryker.com",
    "text": "Stryker is a Fortune 500 medical technology company headquartered in Kalamazoo, Michigan. The company has sponsored Stryke Force and mentored the teams since 2010. Stryker is proud to support STEAM education in greater Kalamazoo and other communities where their employees live and work."
  },
  {
    "name": "Kalamazoo Water Jet",
    "logo": "/img/partners/kalamazoo_water_jet.jpg",
    "url": "https://www.consort.com/kalamazoowaterjet/",
    "text": "One of our longest partnerships, Kalamazoo Waterjet uses abrasive waterjet machines to cut virtually any material or thickness into intricate, precise products. They’ve generously provided a large variety of quality resources to Stryke Force since 2012."
  },
  {
    "name": "CTS",
    "logo": "/img/partners/cts.jpg",
    "url": "https://www.ctstelecom.com",
    "text": "Specializing in data, voice, and internet solutions, we are grateful for the gracious sponsorship of in kind internet services and monetary contributions to Stryke Force since 2013. Much like our team, their goal is to connect the community."
  },
  {
    "name": "Schupan",
    "logo": "/img/partners/schupan.jpg",
    "url": "http://www.schupan.com/home",
    "text": "Metal distribution and recycling for businesses in Kalamazoo, they also recycle electronics. Sponsor to Stryke Force since 2015. Their goal is to mentor and encourage growth in students in the area, a goal Stryke Force shares."
  },
  {
    "name": "Old National Bank",
    "logo": "/img/partners/old_national.jpg",
    "url": "https://www.oldnational.com",
    "text": "A partner since 2017, Old National is our preferred bank and Stryke Force appreciates the donation of both financial support and business expertise to help advise the development our team."
  },
  {
    "name": "Merrill Lynch",
    "logo": "/img/partners/ml.jpg",
    "url": "https://fa.ml.com/michigan/grand-rapids/meadgroup/",
    "text": "The Mead Group is dedicated to helping people achieve their financial goals, providing the highest level of personalized service and care. The Mead Group became a supporter of Stryke Force in 2017."
  },
  {
    "name": "DENSO",
    "logo": "/img/partners/denso.jpg",
    "url": "https://www.denso.com/global/en/",
    "text": "A global automotive manufacturing company that partnered with Stryke Force in 2019. They sponsor our program through grants and monetary donations in order to expand their mission of spreading STEM."
  },
  {
    "name": "Allegra",
    "logo": "/img/partners/allegra.jpg",
    "url": "https://www.allegramarketingprint.com",
    "text": "A full service marketing and print communications company based in Portage, Allegra supports Stryke Force by providing quick and quality printing and friendly, helpful marketing advice since 2014."
  },
  {
    "name": "PTC",
    "logo": "/img/partners/ptc.jpg",
    "url": "https://www.ptc.com",
    "text": "Helps companies design, manufacture, operate and service things for a smart connected world. PTC has donated 3D CAD, collaboration, and analysis software to the team for many years and often provides grant funding."
  },
  {
    "name": "JVTR",
    "logo": "/img/partners/jvtr.jpg",
    "url": "https://www.jvtr.com",
    "text": "An organization of business professionals that help both businesses and individuals to plan financially. They specialize in Accounting and Auditing, Consulting, and Tax Compliance. We are happy to add JVTR to our Stryke Force family in 2018."
  },
  {
    "name": "Chemical Bank",
    "logo": "/img/partners/chemical_bank.jpg",
    "url": "https://www.chemicalbank.com",
    "text": "Chemical Bank specializes in strengthening different communities “one neighborhood at a time” through their different financial options. This goal of helping communities is similar to that of Stryke Force. We welcomed them to our team in 2018."
  },
  {
    "name": "Humphrey Products",
    "logo": "/img/partners/humphrey.jpg",
    "url": "https://www.humphrey-products.com",
    "text": "Recognized as a leading producer of pneumatic products, Humphrey started supporting Stryke Force in the fall of 2018. As a company, they are committed to encouraging education and workforce development in order to create a stronger community."
  },
  {
    "name": "EMA",
    "logo": "/img/partners/ema.jpg",
    "url": "https://www.ema-eda.com",
    "text": "A pioneer in software innovation, EMA Design Automation partners with numerous software designers and providers in order to supply the best to clients, and they partner with Stryke Force to foster strong ties to the community they strive to improve."
  },
  {
    "name": "4H",
    "logo": "/img/partners/4h.jpg",
    "url": "https://4-h.org",
    "text": "The 4-H program teaches and trains both urban and rural kids in a variety of subjects. Our missions align to help youth and improve the world around them. They encourage Stryke Force students to develop their leadership and give back to the community."
  },
  {
    "name": "EFE",
    "logo": "/img/partners/efe.jpg",
    "url": "https://www.kresa.org/efe",
    "text": "The Kalamazoo Regional Educational Service Agency has been a multi-faceted supporter of Stryke Force since 2013. Stryke Force partners with KRESA and Education for Employment (EFE) to encourage STEM and education locally. The EFE mission is to Prepare Today’s Students for Tomorrow’s Careers"
  }
]
